MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J90/mcu.h
extern volatile LCDDATA3bits_t LCDDATA3bits __at(0xFBE);
// bitfield macros
#define _LCDDATA3_LCDDATA3_POSN                             0x0
#define _LCDDATA3_LCDDATA3_POSITION                         0x0
#define _LCDDATA3_LCDDATA3_SIZE                             0x8
#define _LCDDATA3_LCDDATA3_LENGTH                           0x8
#define _LCDDATA3_LCDDATA3_MASK                             0xFF
#define _LCDDATA3_S24C0_POSN                                0x0
#define _LCDDATA3_S24C0_POSITION                            0x0
#define _LCDDATA3_S24C0_SIZE                                0x1
#define _LCDDATA3_S24C0_LENGTH                              0x1
#define _LCDDATA3_S24C0_MASK                                0x1
#define _LCDDATA3_S25C0_POSN                                0x1
#define _LCDDATA3_S25C0_POSITION                            0x1
#define _LCDDATA3_S25C0_SIZE                                0x1
#define _LCDDATA3_S25C0_LENGTH                              0x1
#define _LCDDATA3_S25C0_MASK                                0x2
#define _LCDDATA3_S26C0_POSN                                0x2
#define _LCDDATA3_S26C0_POSITION                            0x2
#define _LCDDATA3_S26C0_SIZE                                0x1
#define _LCDDATA3_S26C0_LENGTH                              0x1
#define _LCDDATA3_S26C0_MASK                                0x4
#define _LCDDATA3_S27C0_POSN                                0x3
#define _LCDDATA3_S27C0_POSITION                            0x3
#define _LCDDATA3_S27C0_SIZE                                0x1
#define _LCDDATA3_S27C0_LENGTH                              0x1
#define _LCDDATA3_S27C0_MASK                                0x8
#define _LCDDATA3_S28C0_POSN                                0x4
#define _LCDDATA3_S28C0_POSITION                            0x4
#define _LCDDATA3_S28C0_SIZE                                0x1
#define _LCDDATA3_S28C0_LENGTH                              0x1
#define _LCDDATA3_S28C0_MASK                                0x10
#define _LCDDATA3_S29C0_POSN                                0x5
#define _LCDDATA3_S29C0_POSITION                            0x5
#define _LCDDATA3_S29C0_SIZE                                0x1
#define _LCDDATA3_S29C0_LENGTH                              0x1
#define _LCDDATA3_S29C0_MASK                                0x20
#define _LCDDATA3_S30C0_POSN                                0x6
#define _LCDDATA3_S30C0_POSITION                            0x6
#define _LCDDATA3_S30C0_SIZE                                0x1
#define _LCDDATA3_S30C0_LENGTH                              0x1
#define _LCDDATA3_S30C0_MASK                                0x40
#define _LCDDATA3_S31C0_POSN                                0x7
#define _LCDDATA3_S31C0_POSITION                            0x7
#define _LCDDATA3_S31C0_SIZE                                0x1
#define _LCDDATA3_S31C0_LENGTH                              0x1
#define _LCDDATA3_S31C0_MASK                                0x80
#define _LCDDATA3_SEG24COM0_POSN                            0x0
#define _LCDDATA3_SEG24COM0_POSITION                        0x0
#define _LCDDATA3_SEG24COM0_SIZE                            0x1
#define _LCDDATA3_SEG24COM0_LENGTH                          0x1
#define _LCDDATA3_SEG24COM0_MASK                            0x1
#define _LCDDATA3_SEG25COM0_POSN                            0x1
#define _LCDDATA3_SEG25COM0_POSITION                        0x1
#define _LCDDATA3_SEG25COM0_SIZE                            0x1
#define _LCDDATA3_SEG25COM0_LENGTH                          0x1
#define _LCDDATA3_SEG25COM0_MASK                            0x2
#define _LCDDATA3_SEG26COM0_POSN                            0x2
#define _LCDDATA3_SEG26COM0_POSITION                        0x2
#define _LCDDATA3_SEG26COM0_SIZE                            0x1
#define _LCDDATA3_SEG26COM0_LENGTH                          0x1
#define _LCDDATA3_SEG26COM0_MASK                            0x4
#define _LCDDATA3_SEG27COM0_POSN                            0x3
#define _LCDDATA3_SEG27COM0_POSITION                        0x3
#define _LCDDATA3_SEG27COM0_SIZE                            0x1
#define _LCDDATA3_SEG27COM0_LENGTH                          0x1
#define _LCDDATA3_SEG27COM0_MASK                            0x8
#define _LCDDATA3_SEG28COM0_POSN                            0x4
#define _LCDDATA3_SEG28COM0_POSITION                        0x4
#define _LCDDATA3_SEG28COM0_SIZE                            0x1
#define _LCDDATA3_SEG28COM0_LENGTH                          0x1
#define _LCDDATA3_SEG28COM0_MASK                            0x10
#define _LCDDATA3_SEG29COM0_POSN                            0x5
#define _LCDDATA3_SEG29COM0_POSITION                        0x5
#define _LCDDATA3_SEG29COM0_SIZE                            0x1
#define _LCDDATA3_SEG29COM0_LENGTH                          0x1
#define _LCDDATA3_SEG29COM0_MASK                            0x20
#define _LCDDATA3_SEG30COM0_POSN                            0x6
#define _LCDDATA3_SEG30COM0_POSITION                        0x6
#define _LCDDATA3_SEG30COM0_SIZE                            0x1
#define _LCDDATA3_SEG30COM0_LENGTH                          0x1
#define _LCDDATA3_SEG30COM0_MASK                            0x40
#define _LCDDATA3_SEG31COM0_POSN                            0x7
#define _LCDDATA3_SEG31COM0_POSITION                        0x7
#define _LCDDATA3_SEG31COM0_SIZE                            0x1
#define _LCDDATA3_SEG31COM0_LENGTH                          0x1
#define _LCDDATA3_SEG31COM0_MASK                            0x80

// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
extern volatile unsigned char           LCDDATA4            __at(0xFBF);
#ifndef _LIB_BUILD
asm("LCDDATA4 equ 0FBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA4               :8;
    };
    struct {
        unsigned S32C0                  :1;
        unsigned S33C0                  :1;
        unsigned S34C0                  :1;
        unsigned S35C0                  :1;
        unsigned S36C0                  :1;
        unsigned S37C0                  :1;
        unsigned S38C0                  :1;
        unsigned S39C0                  :1;
    };
    struct {
        unsigned SEG32COM0              :1;
        unsigned SEG33COM0              :1;
        unsigned SEG34COM0              :1;
        unsigned SEG35COM0              :1;
        unsigned SEG36COM0              :1;
        unsigned SEG37COM0              :1;
        unsigned SEG38COM0              :1;
        unsigned SEG39COM0              :1;
    };
} LCDDATA4bits_t;
extern volatile LCDDATA4bits_t LCDDATA4bits __at(0xFBF);
// bitfield macros
#define _LCDDATA4_LCDDATA4_POSN                             0x0
#define _LCDDATA4_LCDDATA4_POSITION                         0x0
#define _LCDDATA4_LCDDATA4_SIZE                             0x8
#define _LCDDATA4_LCDDATA4_LENGTH                           0x8
#define _LCDDATA4_LCDDATA4_MASK                             0xFF
#define _LCDDATA4_S32C0_POSN                                0x0
#define _LCDDATA4_S32C0_POSITION                            0x0
#define _LCDDATA4_S32C0_SIZE                                0x1
#define _LCDDATA4_S32C0_LENGTH                              0x1
#define _LCDDATA4_S32C0_MASK                                0x1
#define _LCDDATA4_S33C0_POSN                                0x1
#define _LCDDATA4_S33C0_POSITION                            0x1
#define _LCDDATA4_S33C0_SIZE                                0x1
#define _LCDDATA4_S33C0_LENGTH                              0x1
#define _LCDDATA4_S33C0_MASK                                0x2
#define _LCDDATA4_S34C0_POSN                                0x2
#define _LCDDATA4_S34C0_POSITION                            0x2
#define _LCDDATA4_S34C0_SIZE                                0x1
#define _LCDDATA4_S34C0_LENGTH                              0x1
#define _LCDDATA4_S34C0_MASK                                0x4
#define _LCDDATA4_S35C0_POSN                                0x3
#define _LCDDATA4_S35C0_POSITION                            0x3
#define _LCDDATA4_S35C0_SIZE                                0x1
#define _LCDDATA4_S35C0_LENGTH                              0x1
#define _LCDDATA4_S35C0_MASK                                0x8
#define _LCDDATA4_S36C0_POSN                                0x4
#define _LCDDATA4_S36C0_POSITION                            0x4
#define _LCDDATA4_S36C0_SIZE                                0x1
#define _LCDDATA4_S36C0_LENGTH                              0x1
#define _LCDDATA4_S36C0_MASK                                0x10
#define _LCDDATA4_S37C0_POSN                                0x5
#define _LCDDATA4_S37C0_POSITION                            0x5
#define _LCDDATA4_S37C0_SIZE                                0x1
#define _LCDDATA4_S37C0_LENGTH                              0x1
#define _LCDDATA4_S37C0_MASK                                0x20
#define _LCDDATA4_S38C0_POSN                                0x6
#define _LCDDATA4_S38C0_POSITION                            0x6
#define _LCDDATA4_S38C0_SIZE                                0x1
#define _LCDDATA4_S38C0_LENGTH                              0x1
#define _LCDDATA4_S38C0_MASK                                0x40
#define _LCDDATA4_S39C0_POSN                                0x7
#define _LCDDATA4_S39C0_POSITION                            0x7
#define _LCDDATA4_S39C0_SIZE                                0x1
#define _LCDDATA4_S39C0_LENGTH                              0x1
#define _LCDDATA4_S39C0_MASK                                0x80
#define _LCDDATA4_SEG32COM0_POSN                            0x0
#define _LCDDATA4_SEG32COM0_POSITION                        0x0
#define _LCDDATA4_SEG32COM0_SIZE                            0x1
#define _LCDDATA4_SEG32COM0_LENGTH                          0x1
#define _LCDDATA4_SEG32COM0_MASK                            0x1
#define _LCDDATA4_SEG33COM0_POSN                            0x1
#define _LCDDATA4_SEG33COM0_POSITION                        0x1
#define _LCDDATA4_SEG33COM0_SIZE                            0x1
#define _LCDDATA4_SEG33COM0_LENGTH                          0x1
#define _LCDDATA4_SEG33COM0_MASK                            0x2
#define _LCDDATA4_SEG34COM0_POSN                            0x2
#define _LCDDATA4_SEG34COM0_POSITION                        0x2
#define _LCDDATA4_SEG34COM0_SIZE                            0x1
#define _LCDDATA4_SEG34COM0_LENGTH                          0x1
#define _LCDDATA4_SEG34COM0_MASK                            0x4
#define _LCDDATA4_SEG35COM0_POSN                            0x3
#define _LCDDATA4_SEG35COM0_POSITION                        0x3
#define _LCDDATA4_SEG35COM0_SIZE                            0x1
#define _LCDDATA4_SEG35COM0_LENGTH                          0x1
#define _LCDDATA4_SEG35COM0_MASK                            0x8
#define _LCDDATA4_SEG36COM0_POSN                            0x4
#define _LCDDATA4_SEG36COM0_POSITION                        0x4
#define _LCDDATA4_SEG36COM0_SIZE                            0x1
#define _LCDDATA4_SEG36COM0_LENGTH                          0x1
#define _LCDDATA4_SEG36COM0_MASK                            0x10
#define _LCDDATA4_SEG37COM0_POSN                            0x5
#define _LCDDATA4_SEG37COM0_POSITION                        0x5
#define _LCDDATA4_SEG37COM0_SIZE                            0x1
#define _LCDDATA4_SEG37COM0_LENGTH                          0x1
#define _LCDDATA4_SEG37COM0_MASK                            0x20
#define _LCDDATA4_SEG38COM0_POSN                            0x6
#define _LCDDATA4_SEG38COM0_POSITION                        0x6
#define _LCDDATA4_SEG38COM0_SIZE                            0x1
#define _LCDDATA4_SEG38COM0_LENGTH                          0x1
#define _LCDDATA4_SEG38COM0_MASK                            0x40
#define _LCDDATA4_SEG39COM0_POSN                            0x7
#define _LCDDATA4_SEG39COM0_POSITION                        0x7
#define _LCDDATA4_SEG39COM0_SIZE                            0x1
#define _LCDDATA4_SEG39COM0_LENGTH                          0x1
#define _LCDDATA4_SEG39COM0_MASK                            0x80

// Register: ADCON2
#define ADCON2 ADCON2
extern volatile unsigned char           ADCON2              __at(0xFC0);
#ifndef _LIB_BUILD
asm("ADCON2 equ 0FC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCS                   :3;
        unsigned ACQT                   :3;
        unsigned                        :1;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ACQT0                  :1;
        unsigned ACQT1                  :1;
        unsigned ACQT2                  :1;
    };
} ADCON2bits_t;
